<template>
  <div class="agreement">
    <div class="agreement-box">
      <span class="title">采购文件合规性审查用户使用协议</span>
      <div class="content">
        &nbsp;&nbsp;尊敬的用户：<br />
        &nbsp;&nbsp; 欢迎使用采购文件合规性审查服务（以下简称“本服务”）！在您使用本服务之前，请您仔细阅读本《用户使用协议》（以下简称 “本协议”）。本协议详细规定了您作为用户与服务提供方博思数采科技股份有限公司（以下简称“博思数采”）之间的权利、义务以及使用服务的相关规则和条款。<br />
        &nbsp;&nbsp;本协议具有重要的法律意义，旨在确保您在使用本服务时，能够明确了解双方的权利和义务，保障您的合法权益，同时也有助于我们为您提供优质、安全、可靠的服务。通过本协议，您可以清楚地知晓如何正确使用服务，以及在使用过程中可能面临的风险和责任。本协议构成您与我们之间的具有法律约束力的文件，与书面合同具有同等的法律效力。一旦您点击或勾选同意本协议并使用服务，即表示您已充分理解并接受本协议的所有条款，并同意受其约束。如果您不同意本协议的任何条款，请立即停止使用本服务。<br />
       <span class="sub-title"> 一、服务说明</span>
   &nbsp;&nbsp;本服务依托强大的 AI 模型，实现对采购文件的智能化合规性审查，助力提升审查效率与质量。<br />
<span class="sub-title">二、账号使用和管理</span>
   &nbsp;&nbsp;（1）注册：在您打算使用本服务之前，您需要完成用户注册流程。注册时，您需要准确填写相关的个人信息，包括但不限于您的姓名、电子邮箱、手机号码等。这些信息将用于身份验证、服务通知以及客户服务等目的；您承诺并保证所提供的注册信息真实、准确、完整且有效，如发现任何虚假或误导性的信息，博思数采有权暂停或终止您的账户使用，并依法追究您的相关责任；您的注册信息可能会随着时间和情况的变化而发生变化，为了确保您的账户安全和服务的正常使用，您应及时更新您的注册信息；您只能注册一个账户用于使用本服务，以防止滥用服务资源和扰乱正常的服务秩序。如果您被发现拥有多个账户，博思数采有权对您的账户进行合并或注销，并对您的使用行为进行审查。<br />
   &nbsp;&nbsp;（2）转让：您有责任妥善保管您的账号，不得擅自将账号转让、出借、出租或以其他形式提供给他人使用。您应对您的账号安全负责，采取适当的保密措施以防止他人未经授权访问您的账号。如果您发现账号被盗用或被非法使用，您应立即采取措施保护自己的账号安全，并及时通知相关平台或服务提供商。如果您因自身原因未妥善保管账号，包括但不限于账号被盗窃或非法利用后未及时采取补救措施，由此导致的任何损失和责任应由您自行承担。平台对因用户自身原因导致的账号安全问题不承担任何责任。<br />
<span class="sub-title">三、权利和义务</span>
   &nbsp;&nbsp;您有权依据本协议的约定使用采购文件合规性审查相关服务，并提出建议或反馈。<br />
   &nbsp;&nbsp;您在使用本服务时，必须严格遵守国家相关法律法规，不得利用该服务从事任何违法活动，否则，您将承担由此产生的一切法律责任；您应按照本协议约定的用途和方式使用本服务，不得将该服务用于任何未经授权的商业用途或其他非法目的；使用本服务上传文件时采购文件不得包含色情、暴力等违法内容，否则博思数采将有权对您的账号进行封禁处理。用户应确保其上传的文件不包含任何侵犯他人隐私、商业秘密或其他合法权益的内容。如因用户上传的文件引发的任何纠纷或法律责任，由用户自行承担。<br />
<span class="sub-title">四、知识产权</span>
   &nbsp;&nbsp;博思数采依法享有采购文件合规性审查相关服务的所有合法权利，包括但不限于著作权、商标权、专利权等知识产权。这些权利受法律的严格保护，任何未经授权的使用、复制、修改或传播博思数采的知识产权内容的行为都是侵犯博思数采合法权益的，博思数采将依法追究侵权方的法律责任。<br />
<span class="sub-title">五、用户信息保护</span>
   &nbsp;&nbsp;博思数采将采取合理的安全措施来保护您的个人信息，包括但不限于数据加密、访问控制等技术手段和管理措施，以防止信息的泄露、篡改或丢失。同时，博思数采会定期对安全措施进行评估和改进，以适应不断变化的安全环境。<br />
   &nbsp;&nbsp;博思数采深知用户上传文件的机密性和敏感性，对此将采取以下保密措施：<br />
   &nbsp;&nbsp;（1）访问限制 ：严格限制内部员工对用户上传文件的访问权限，仅允许因提供服务必需的授权人员访问，并要求他们遵守严格的保密义务。<br />
   &nbsp;&nbsp;（2）数据加密 ：对用户上传的文件在存储和传输过程中进行加密处理，确保文件内容在技术层面得到保护。<br />
<span class="sub-title">六、法律适用与争议解决</span>
   &nbsp;&nbsp;本协议之订立、生效、解释、修订、补充、终止、执行与争议解决均适用中华人民共和国大陆地区法律。<br />
   &nbsp;&nbsp;您知晓并认可，博思数采虽全力保障服务品质，但本服务仍存在以下不确定性：<br />
   &nbsp;&nbsp;（1）尽管博思数采致力于不断提升本服务的技术水平，但智能审查技术仍存在一定的局限性。审查结果可能因技术瓶颈、算法偏差、数据更新不及时等因素，与实际合规要求存在偏差。
   &nbsp;&nbsp;（2）采购文件合规性审查涉及对法律法规的理解和适用，不同地区、不同行业的法律法规可能存在差异和变化。博思数采的本服务是基于通用的法律法规和行业标准进行设计和开发的，可能无法涵盖所有特殊情况或地区性差异。<br />
   &nbsp;&nbsp;（3）审查结果难以做到百分百准确无误、完整详尽、功能持续可用、及时推送、安全稳定以及无任何故障。因此，请您切勿将采购文件合规性审查生成内容当作唯一可信的事实信息源或专业建议的替代选项，建议综合考量多方信息。<br />
<span class="sub-title">七、责任限制</span>
   &nbsp;&nbsp; 我们依照法律规定履行基础保障义务，但对于下述原因导致的合同履行障碍、履行瑕疵、履行延后或履行内容变更等情形，我们不承担相应的责任：<br />
   &nbsp;&nbsp;（1）因自然灾害、罢工、暴乱、战争、政府行为、司法行政命令等不可抗力因素。<br />
   &nbsp;&nbsp;（2）因电力供应故障、通讯网络故障等公共服务因素或第三人因素；<br />
   &nbsp;&nbsp;（3）在已尽善意管理的情况下，因常规或紧急的设备与系统维护、设备与系统故障、网络信息与数据安全等因素。<br />
    </div>
    </div>
    <a-button type="primary" class="btn-yy" @click="doRead">我已阅读</a-button>
  </div>
</template>

<script setup lang="ts">
defineOptions({
  name: 'UserAgreement'
})
const emits = defineEmits(['read'])
function doRead() {
  emits('read')
}
</script>
<style lang="scss" scoped>
.agreement {
  width: 100%;
  display: flex;
  flex-direction: column;
  align-items: center;
  background: var(--login-bg) 100% no-repeat;
  background-size: cover;
  .agreement-box {
    margin-top: 32px; 
    display: flex;
    flex-direction: column;
    align-items: center; 
    max-width: 1000px;
    box-sizing: border-box;
    padding: 0 24px;
    .title { 
      font-weight: bold;
      font-size: 22px;
    }

    .content {
      font-family: Source Han Sans;
      font-size: var(--font-14);
      font-weight: normal;
      line-height: normal;
      text-align: justify;
      font-feature-settings: "kern" on;
      white-space: break-spaces;
      .sub-title {
        display: block;
        font-weight: bold;
        padding: 10px 0;
      }
    }
  }

  .btn-yy {
    margin: 10px 0;
    width: 96px;
    height: 40px;
    border-radius: var(--border-radius-8);
    margin-bottom: 200px;
  }
}

</style>
